In [1]:
import numpy as np
import pandas as pd

In [2]:
nrows, ncols = 100000, 100
df1, df2, df3, df4 = (pd.DataFrame(np.random.rand(nrows, ncols)) for i in range(4))

In [3]:
%timeit df1 + df2 + df3 + df4

114 ms ± 4.9 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [4]:
%timeit pd.eval('df1 + df2 + df3 + df4')

140 ms ± 22.9 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [5]:
%timeit pd.eval('df1 * -df2 / (-df3 * df4)')

252 ms ± 44.3 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [6]:
%timeit (df1 < df2) & (df2 <= df3) & (df3 != df4)

79.6 ms ± 7.17 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [7]:
%timeit pd.eval('(df1 < df2) & (df2 <= df3) & (df3 != df4)')

88.5 ms ± 19.9 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [9]:
df = pd.DataFrame(np.random.rand(1000000, 5), columns =['A', 'B', 'C', 'D', 'E'])
df.head()

          A         B         C         D         E
0  0.628064  0.244682  0.211678  0.644953  0.873641
1  0.711124  0.357135  0.225275  0.958340  0.580743
2  0.064294  0.358034  0.854607  0.146264  0.243250
3  0.415158  0.970964  0.976914  0.577385  0.002350
4  0.705099  0.548327  0.340239  0.565613  0.594509

In [10]:
%timeit df['A'] + df['B'] / df['C'] - df['D']

23.8 ms ± 2.75 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [11]:
%timeit df['A'] + df['B'] / df['C'] - df['D'] * df['E']

23.8 ms ± 595 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [12]:
%timeit pd.eval('df.A + df.B / df.C - df.D * df.E')

26 ms ± 1.8 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [13]:
%timeit df.eval('A+B/C-D*E')

34.5 ms ± 4.52 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [16]:
df.eval('R = A - B / C + D * E', inplace=True)
df.head()

          A         B         C         D         E         R
0  0.628064  0.244682  0.211678  0.644953  0.873641  0.035608
1  0.711124  0.357135  0.225275  0.958340  0.580743 -0.317653
2  0.064294  0.358034  0.854607  0.146264  0.243250 -0.319073
3  0.415158  0.970964  0.976914  0.577385  0.002350 -0.577394
4  0.705099  0.548327  0.340239  0.565613  0.594509 -0.570232

In [17]:
col_mean = df.mean(1)
df['A'] + col_mean

0         1.067835
1         1.130284
2         0.288857
3         0.809388
4         1.069025
            ...
999995    0.729247
999996    1.442812
999997    0.557821
999998    0.325459
999999    0.223317
Length: 1000000, dtype: float64

In [18]:
df.eval('A + @col_mean')

0         1.067835
1         1.130284
2         0.288857
3         0.809388
4         1.069025
            ...
999995    0.729247
999996    1.442812
999997    0.557821
999998    0.325459
999999    0.223317
Length: 1000000, dtype: float64

In [19]:
df[(df.A<0.5)&(df.B<0.5)&(df.C>0.5)]

               A         B         C         D         E         R
2       0.064294  0.358034  0.854607  0.146264  0.243250 -0.319073
10      0.052838  0.035282  0.691146  0.767657  0.813246  0.626084
21      0.242112  0.213370  0.564110  0.190064  0.401964 -0.059732
31      0.145604  0.445215  0.945015  0.982202  0.746589  0.407786
32      0.076776  0.200750  0.966002  0.549375  0.147103 -0.050225
...          ...       ...       ...       ...       ...       ...
999963  0.144727  0.005289  0.629849  0.391773  0.946615  0.507187
999964  0.498006  0.097464  0.725133  0.702702  0.419170  0.658148
999975  0.466461  0.436837  0.679121  0.751454  0.246331  0.008330
999983  0.089143  0.152096  0.548292  0.203136  0.480710 -0.090607
999997  0.294069  0.215057  0.518479  0.210085  0.384714 -0.039892

[124773 rows x 6 columns]

In [24]:
pd.eval('df[(df.A<0.5)&(df.B<0.5)&(df.C>0.5)]')

               A         B         C         D         E         R
2       0.064294  0.358034  0.854607  0.146264  0.243250 -0.319073
10      0.052838  0.035282  0.691146  0.767657  0.813246  0.626084
21      0.242112  0.213370  0.564110  0.190064  0.401964 -0.059732
31      0.145604  0.445215  0.945015  0.982202  0.746589  0.407786
32      0.076776  0.200750  0.966002  0.549375  0.147103 -0.050225
...          ...       ...       ...       ...       ...       ...
999963  0.144727  0.005289  0.629849  0.391773  0.946615  0.507187
999964  0.498006  0.097464  0.725133  0.702702  0.419170  0.658148
999975  0.466461  0.436837  0.679121  0.751454  0.246331  0.008330
999983  0.089143  0.152096  0.548292  0.203136  0.480710 -0.090607
999997  0.294069  0.215057  0.518479  0.210085  0.384714 -0.039892

[124773 rows x 6 columns]

In [25]:
df.query('(A<0.5)&(B<0.5)&(C>0.5)')

               A         B         C         D         E         R
2       0.064294  0.358034  0.854607  0.146264  0.243250 -0.319073
10      0.052838  0.035282  0.691146  0.767657  0.813246  0.626084
21      0.242112  0.213370  0.564110  0.190064  0.401964 -0.059732
31      0.145604  0.445215  0.945015  0.982202  0.746589  0.407786
32      0.076776  0.200750  0.966002  0.549375  0.147103 -0.050225
...          ...       ...       ...       ...       ...       ...
999963  0.144727  0.005289  0.629849  0.391773  0.946615  0.507187
999964  0.498006  0.097464  0.725133  0.702702  0.419170  0.658148
999975  0.466461  0.436837  0.679121  0.751454  0.246331  0.008330
999983  0.089143  0.152096  0.548292  0.203136  0.480710 -0.090607
999997  0.294069  0.215057  0.518479  0.210085  0.384714 -0.039892

[124773 rows x 6 columns]

In [26]:
col_mean = df['D'].mean()
df[(df.A < col_mean) & (df.B < col_mean)]

               A         B         C         D         E         R
2       0.064294  0.358034  0.854607  0.146264  0.243250 -0.319073
10      0.052838  0.035282  0.691146  0.767657  0.813246  0.626084
12      0.097882  0.254298  0.150072  0.257681  0.866569 -1.373319
17      0.096533  0.157808  0.248241  0.481711  0.529195 -0.284255
21      0.242112  0.213370  0.564110  0.190064  0.401964 -0.059732
...          ...       ...       ...       ...       ...       ...
999983  0.089143  0.152096  0.548292  0.203136  0.480710 -0.090607
999984  0.312828  0.366054  0.323839  0.697386  0.990851 -0.126523
999992  0.336953  0.057326  0.052306  0.674175  0.324850 -0.540002
999995  0.234404  0.070713  0.327293  0.952709  0.699330  0.684609
999997  0.294069  0.215057  0.518479  0.210085  0.384714 -0.039892

[249374 rows x 6 columns]

In [27]:
df.query('A < @col_mean and B < @col_mean')

               A         B         C         D         E         R
2       0.064294  0.358034  0.854607  0.146264  0.243250 -0.319073
10      0.052838  0.035282  0.691146  0.767657  0.813246  0.626084
12      0.097882  0.254298  0.150072  0.257681  0.866569 -1.373319
17      0.096533  0.157808  0.248241  0.481711  0.529195 -0.284255
21      0.242112  0.213370  0.564110  0.190064  0.401964 -0.059732
...          ...       ...       ...       ...       ...       ...
999983  0.089143  0.152096  0.548292  0.203136  0.480710 -0.090607
999984  0.312828  0.366054  0.323839  0.697386  0.990851 -0.126523
999992  0.336953  0.057326  0.052306  0.674175  0.324850 -0.540002
999995  0.234404  0.070713  0.327293  0.952709  0.699330  0.684609
999997  0.294069  0.215057  0.518479  0.210085  0.384714 -0.039892

[249374 rows x 6 columns]

In [28]:
s1 = pd.Series(['a', 'b'], index=[1, 2])
s2 = pd.Series(['c', 'd'], index=[3, 4])
pd.concat([s1, s2])

1    a
2    b
3    c
4    d
dtype: object

In [29]:
def create_df(cols, idx):
    data = {c:[str(c.lower())+str(i) for i in idx] for c in cols}
    return pd.DataFrame(data, idx)

In [30]:
df1 = create_df('AB', [1, 2])
df1

    A   B
1  a1  b1
2  a2  b2

In [32]:
df2 = create_df('AB', [3, 4])
df2

    A   B
3  a3  b3
4  a4  b4

In [33]:
pd.concat([df1, df2])

    A   B
1  a1  b1
2  a2  b2
3  a3  b3
4  a4  b4

In [34]:
df3 = create_df('AB', [0, 1])
df3

    A   B
0  a0  b0
1  a1  b1

In [35]:
df4 = create_df('CD', [0, 1])
df4

    C   D
0  c0  d0
1  c1  d1

In [36]:
pd.concat([df3, df4])

     A    B    C    D
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
0  NaN  NaN   c0   d0
1  NaN  NaN   c1   d1

In [37]:
pd.concat([df1, df3], verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([1], dtype='int64')

In [38]:
pd.concat([df1, df3], ignore_index=True)

    A   B
0  a1  b1
1  a2  b2
2  a0  b0
3  a1  b1

In [39]:
df1

    A   B
1  a1  b1
2  a2  b2

In [40]:
df3

    A   B
0  a0  b0
1  a1  b1

In [41]:
pd.concat([df1, df3], keys=['X', 'Y'])

      A   B
X 1  a1  b1
  2  a2  b2
Y 0  a0  b0
  1  a1  b1

In [43]:
df5 = create_df('ABC', [1, 2])
df6 = create_df('BCD', [3, 4])
pd.concat([df5, df6])

     A   B   C    D
1   a1  b1  c1  NaN
2   a2  b2  c2  NaN
3  NaN  b3  c3   d3
4  NaN  b4  c4   d4

In [44]:
pd.concat([df5, df6], join='inner')

    B   C
1  b1  c1
2  b2  c2
3  b3  c3
4  b4  c4

In [45]:
df5.append(df6)

     A   B   C    D
1   a1  b1  c1  NaN
2   a2  b2  c2  NaN
3  NaN  b3  c3   d3
4  NaN  b4  c4   d4

In [46]:
pd.concat([df3, df4], axis=1)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1

In [47]:
pd.concat([df1, df3])

    A   B
1  a1  b1
2  a2  b2
0  a0  b0
1  a1  b1

In [48]:
df1

    A   B
1  a1  b1
2  a2  b2

In [49]:
df3

    A   B
0  a0  b0
1  a1  b1

In [50]:
df1 = pd.DataFrame({'학생':['홍길동', '이순신', '임꺽정', '김유신'],
                    '학과':['경영학과', '교육학과', '컴퓨터학과', '통계학과']})
df1

    학생     학과
0  홍길동   경영학과
1  이순신   교육학과
2  임꺽정  컴퓨터학과
3  김유신   통계학과

In [51]:
df2 = pd.DataFrame({'학생': ['홍길동', '이순신', '임꺽정', '김유신'],
                    '입학년도': [2012, 2016, 2019, 2020]})
df2

    학생  입학년도
0  홍길동  2012
1  이순신  2016
2  임꺽정  2019
3  김유신  2020

In [52]:
df3 = pd.merge(df1, df2)
df3

    학생     학과  입학년도
0  홍길동   경영학과  2012
1  이순신   교육학과  2016
2  임꺽정  컴퓨터학과  2019
3  김유신   통계학과  2020

In [53]:
df4 = pd.DataFrame({'학과':['경영학과', '교육학과', '컴퓨터학과', '통계학과'],
                    '학과장':['황희', '장영실', '안창호', '정약용']})
df4

      학과  학과장
0   경영학과   황희
1   교육학과  장영실
2  컴퓨터학과  안창호
3   통계학과  정약용

In [55]:
pd.merge(df3, df4)

    학생     학과  입학년도  학과장
0  홍길동   경영학과  2012   황희
1  이순신   교육학과  2016  장영실
2  임꺽정  컴퓨터학과  2019  안창호
3  김유신   통계학과  2020  정약용

In [56]:
df5 = pd.DataFrame({'학과':['경영학과', '교육학과', '교육학과', '컴퓨터학과', '컴퓨터학과', '통계학과'],
                    '과목':['경영개론', '기초수학', '물리학', '프로그래밍', '운영체제', '확률론']})
df5

      학과     과목
0   경영학과   경영개론
1   교육학과   기초수학
2   교육학과    물리학
3  컴퓨터학과  프로그래밍
4  컴퓨터학과   운영체제
5   통계학과    확률론

In [57]:
pd.merge(df1, df5)

    학생     학과     과목
0  홍길동   경영학과   경영개론
1  이순신   교육학과   기초수학
2  이순신   교육학과    물리학
3  임꺽정  컴퓨터학과  프로그래밍
4  임꺽정  컴퓨터학과   운영체제
5  김유신   통계학과    확률론

In [58]:
df6 = pd.DataFrame({'이름':['홍길동', '이순신', '임꺽정', '김유신'],
                    '성적':['A', 'A+', 'B', 'A+']})
df6

    이름  성적
0  홍길동   A
1  이순신  A+
2  임꺽정   B
3  김유신  A+

In [60]:
pd.merge(df1, df6, left_on='학생', right_on='이름')

    학생     학과   이름  성적
0  홍길동   경영학과  홍길동   A
1  이순신   교육학과  이순신  A+
2  임꺽정  컴퓨터학과  임꺽정   B
3  김유신   통계학과  김유신  A+

In [61]:
pd.merge(df1, df6, left_on='학생', right_on='이름').drop('이름', axis=1)

    학생     학과  성적
0  홍길동   경영학과   A
1  이순신   교육학과  A+
2  임꺽정  컴퓨터학과   B
3  김유신   통계학과  A+

In [62]:
mdf1 = df1.set_index('학생')
mdf2 = df2.set_index('학생')

In [63]:
mdf1

        학과
학생
홍길동   경영학과
이순신   교육학과
임꺽정  컴퓨터학과
김유신   통계학과

In [64]:
mdf2

     입학년도
학생
홍길동  2012
이순신  2016
임꺽정  2019
김유신  2020

In [65]:
pd.merge(mdf1, mdf2, left_index=True, right_index=True)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2016
임꺽정  컴퓨터학과  2019
김유신   통계학과  2020

In [66]:
mdf1.join(mdf2)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2016
임꺽정  컴퓨터학과  2019
김유신   통계학과  2020

In [72]:
pd.merge(mdf1, df6, left_index=True, right_on='이름')

      학과   이름  성적
0   경영학과  홍길동   A
1   교육학과  이순신  A+
2  컴퓨터학과  임꺽정   B
3   통계학과  김유신  A+

In [68]:
mdf1

        학과
학생
홍길동   경영학과
이순신   교육학과
임꺽정  컴퓨터학과
김유신   통계학과

In [69]:
df6

    이름  성적
0  홍길동   A
1  이순신  A+
2  임꺽정   B
3  김유신  A+

In [73]:
df7 = pd.DataFrame({'이름':['홍길동', '이순신', '임꺽정'],
                    '주문음식':['햄버거', '피자', '짜장면']})
df7

    이름 주문음식
0  홍길동  햄버거
1  이순신   피자
2  임꺽정  짜장면

In [74]:
df8 = pd.DataFrame({'이름': ['홍길동', '이순신', '김유신'],
                    '주문음료': ['콜라', '사이다', '커피']})
df8

    이름 주문음료
0  홍길동   콜라
1  이순신  사이다
2  김유신   커피

In [75]:
pd.merge(df7, df8)

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다

In [76]:
pd.merge(df7, df8, how='outer')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN
3  김유신  NaN   커피

In [77]:
pd.merge(df7, df8, how='left')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN

In [78]:
pd.merge(df7, df8, how='right')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  김유신  NaN   커피

In [79]:
df9 = pd.DataFrame({'이름':['홍길동', '이순신', '임꺽정', '김유신'],
                    '순위':[3, 2, 4, 1]})
df9

    이름  순위
0  홍길동   3
1  이순신   2
2  임꺽정   4
3  김유신   1

In [80]:
df10 = pd.DataFrame({'이름': ['홍길동', '이순신', '임꺽정', '김유신'],
                    '순위': [4, 1, 3, 2]})
df10

    이름  순위
0  홍길동   4
1  이순신   1
2  임꺽정   3
3  김유신   2

In [82]:
pd.merge(df9, df10, on='이름', suffixes=['_인기', '_성적'])

    이름  순위_인기  순위_성적
0  홍길동      3      4
1  이순신      2      1
2  임꺽정      4      3
3  김유신      1      2

In [84]:
df = pd.DataFrame([[1, 1.2, np.nan],
                   [2.4, 5.5, 4.2],
                   [np.nan, np.nan, np.nan],
                   [0.44, -3.1, -4.1]],
                  index=[1, 2, 3, 4],
                  columns=['A', 'B', 'C'])
df

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [85]:
df.head(2)

     A    B    C
1  1.0  1.2  NaN
2  2.4  5.5  4.2

In [86]:
df.tail(2)

      A    B    C
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [87]:
df.describe()

              A     B         C
count  3.000000  3.00  2.000000
mean   1.280000  1.20  0.050000
std    1.009554  4.30  5.868986
min    0.440000 -3.10 -4.100000
25%    0.720000 -0.95 -2.025000
50%    1.000000  1.20  0.050000
75%    1.700000  3.35  2.125000
max    2.400000  5.50  4.200000

In [88]:
print(df)
print(np.argmin(df), np.argmax(df))

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
2 2

In [89]:
print(df)
print(df.idxmin())
print(df.idxmax())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    4
B    4
C    4
dtype: int64
A    2
B    2
C    2
dtype: int64

In [90]:
print(df)
print(df.std())
print(df.var())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    1.009554
B    4.300000
C    5.868986
dtype: float64
A     1.0192
B    18.4900
C    34.4450
dtype: float64

In [91]:
print(df)
print(df.skew())
print(df.kurt())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    1.15207
B    0.00000
C        NaN
dtype: float64
A   NaN
B   NaN
C   NaN
dtype: float64

In [93]:
print(df)
print(df.sum())
print(df.cumsum())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    3.84
B    3.60
C    0.10
dtype: float64
      A    B    C
1  1.00  1.2  NaN
2  3.40  6.7  4.2
3   NaN  NaN  NaN
4  3.84  3.6  0.1

In [94]:
print(df)
print(df.prod())
print(df.cumprod())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A     1.056
B   -20.460
C   -17.220
dtype: float64
       A      B      C
1  1.000   1.20    NaN
2  2.400   6.60   4.20
3    NaN    NaN    NaN
4  1.056 -20.46 -17.22

In [95]:
df.diff()

     A    B   C
1  NaN  NaN NaN
2  1.4  4.3 NaN
3  NaN  NaN NaN
4  NaN  NaN NaN

In [96]:
df.quantile()

A    1.00
B    1.20
C    0.05
Name: 0.5, dtype: float64

In [97]:
df.pct_change()

          A         B        C
1       NaN       NaN      NaN
2  1.400000  3.583333      NaN
3  0.000000  0.000000  0.00000
4 -0.816667 -1.563636 -1.97619

In [98]:
df.corr()

          A         B    C
A  1.000000  0.970725  1.0
B  0.970725  1.000000  1.0
C  1.000000  1.000000  1.0

In [99]:
df.corrwith(df.B)

A    0.970725
B    1.000000
C    1.000000
dtype: float64

In [100]:
df.cov()

        A       B       C
A  1.0192   4.214   8.134
B  4.2140  18.490  35.690
C  8.1340  35.690  34.445

In [101]:
df['B'].unique()

array([ 1.2,  5.5,  nan, -3.1])

In [102]:
df['A'].value_counts()

1.00    1
2.40    1
0.44    1
Name: A, dtype: int64

In [103]:
df = pd.DataFrame({'c1': ['a', 'a', 'b', 'b', 'c', 'd', 'd'],
                   'c2': ['A', 'B', 'B', 'A', 'D', 'C', 'C'],
                   'c3': np.random.randint(7),
                   'c4': np.random.random(7)})
df

  c1 c2  c3        c4
0  a  A   5  0.920407
1  a  B   5  0.239978
2  b  B   5  0.675853
3  b  A   5  0.264029
4  c  D   5  0.273653
5  d  C   5  0.502474
6  d  C   5  0.004967

In [104]:
df.dtypes

c1     object
c2     object
c3      int64
c4    float64
dtype: object

In [105]:
df['c3'].groupby(df['c1']).mean()

c1
a    5.0
b    5.0
c    5.0
d    5.0
Name: c3, dtype: float64

In [106]:
df['c4'].groupby(df['c2']).std()

c2
A    0.464129
B    0.308210
C    0.351790
D         NaN
Name: c4, dtype: float64

In [109]:
df['c4'].groupby([df['c1'], df['c2']]).mean().unstack()

c2         A         B         C         D
c1
a   0.920407  0.239978       NaN       NaN
b   0.264029  0.675853       NaN       NaN
c        NaN       NaN       NaN  0.273653
d        NaN       NaN  0.253721       NaN

In [110]:
df.groupby('c1').mean()

     c3        c4
c1
a   5.0  0.580193
b   5.0  0.469941
c   5.0  0.273653
d   5.0  0.253721

In [111]:
df.groupby(['c1', 'c2']).mean()

        c3        c4
c1 c2
a  A   5.0  0.920407
   B   5.0  0.239978
b  A   5.0  0.264029
   B   5.0  0.675853
c  D   5.0  0.273653
d  C   5.0  0.253721

In [112]:
df.groupby(['c1', 'c2']).size()

c1  c2
a   A     1
    B     1
b   A     1
    B     1
c   D     1
d   C     2
dtype: int64

In [113]:
for c1, group in df.groupby('c1'):
    print(c1)
    print(group)

a
  c1 c2  c3        c4
0  a  A   5  0.920407
1  a  B   5  0.239978
b
  c1 c2  c3        c4
2  b  B   5  0.675853
3  b  A   5  0.264029
c
  c1 c2  c3        c4
4  c  D   5  0.273653
d
  c1 c2  c3        c4
5  d  C   5  0.502474
6  d  C   5  0.004967

In [114]:
df

  c1 c2  c3        c4
0  a  A   5  0.920407
1  a  B   5  0.239978
2  b  B   5  0.675853
3  b  A   5  0.264029
4  c  D   5  0.273653
5  d  C   5  0.502474
6  d  C   5  0.004967

In [115]:
for (c1, c2), group in df.groupby(['c1', 'c2']):
    print((c1, c2))
    print(group)

('a', 'A')
  c1 c2  c3        c4
0  a  A   5  0.920407
('a', 'B')
  c1 c2  c3        c4
1  a  B   5  0.239978
('b', 'A')
  c1 c2  c3        c4
3  b  A   5  0.264029
('b', 'B')
  c1 c2  c3        c4
2  b  B   5  0.675853
('c', 'D')
  c1 c2  c3        c4
4  c  D   5  0.273653
('d', 'C')
  c1 c2  c3        c4
5  d  C   5  0.502474
6  d  C   5  0.004967

In [117]:
df.groupby(['c1', 'c2'])[['c4']].mean()

             c4
c1 c2
a  A   0.920407
   B   0.239978
b  A   0.264029
   B   0.675853
c  D   0.273653
d  C   0.253721

In [118]:
df.groupby('c1')['c3'].quantile()

c1
a    5.0
b    5.0
c    5.0
d    5.0
Name: c3, dtype: float64

In [119]:
df.groupby('c1')['c3'].count()

c1
a    2
b    2
c    1
d    2
Name: c3, dtype: int64

In [120]:
df.groupby('c1')['c4'].median()

c1
a    0.580193
b    0.469941
c    0.273653
d    0.253721
Name: c4, dtype: float64

In [121]:
df.groupby('c1')['c4'].std()

c1
a    0.481136
b    0.291203
c         NaN
d    0.351790
Name: c4, dtype: float64

In [123]:
df.groupby(['c1', 'c2'])['c4'].agg(['mean', 'min', 'max', 'sum'])

           mean       min       max       sum
c1 c2
a  A   0.920407  0.920407  0.920407  0.920407
   B   0.239978  0.239978  0.239978  0.239978
b  A   0.264029  0.264029  0.264029  0.264029
   B   0.675853  0.675853  0.675853  0.675853
c  D   0.273653  0.273653  0.273653  0.273653
d  C   0.253721  0.004967  0.502474  0.507441

In [124]:
df.groupby(['c1', 'c2'], as_index=False)['c4'].mean()

  c1 c2        c4
0  a  A  0.920407
1  a  B  0.239978
2  b  A  0.264029
3  b  B  0.675853
4  c  D  0.273653
5  d  C  0.253721

In [125]:
df.groupby(['c1', 'c2'], group_keys=False)['c4'].mean()

c1  c2
a   A     0.920407
    B     0.239978
b   A     0.264029
    B     0.675853
c   D     0.273653
d   C     0.253721
Name: c4, dtype: float64

In [126]:
def top(df, n=3, column = 'c1'):
    return df.sort_values(by=column)[-n:]

top(df, n=5)

  c1 c2  c3        c4
2  b  B   5  0.675853
3  b  A   5  0.264029
4  c  D   5  0.273653
5  d  C   5  0.502474
6  d  C   5  0.004967

In [127]:
df.groupby('c1').apply(top)

     c1 c2  c3        c4
c1
a  0  a  A   5  0.920407
   1  a  B   5  0.239978
b  2  b  B   5  0.675853
   3  b  A   5  0.264029
c  4  c  D   5  0.273653
d  5  d  C   5  0.502474
   6  d  C   5  0.004967

In [128]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'])

     c3                       c4
c2    A    B    C    D         A         B         C         D
c1
a   5.0  5.0  NaN  NaN  0.920407  0.239978       NaN       NaN
b   5.0  5.0  NaN  NaN  0.264029  0.675853       NaN       NaN
c   NaN  NaN  NaN  5.0       NaN       NaN       NaN  0.273653
d   NaN  NaN  5.0  NaN       NaN       NaN  0.253721       NaN

In [129]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True)

      c3                            c4
c2     A    B    C    D  All         A         B         C         D       All
c1
a    5.0  5.0  NaN  NaN  5.0  0.920407  0.239978       NaN       NaN  0.580193
b    5.0  5.0  NaN  NaN  5.0  0.264029  0.675853       NaN       NaN  0.469941
c    NaN  NaN  NaN  5.0  5.0       NaN       NaN       NaN  0.273653  0.273653
d    NaN  NaN  5.0  NaN  5.0       NaN       NaN  0.253721       NaN  0.253721
All  5.0  5.0  5.0  5.0  5.0  0.592218  0.457916  0.253721  0.273653  0.411623

In [130]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum)

       c3                             c4                                \
c2      A     B     C    D All         A         B         C         D
c1
a     5.0   5.0   NaN  NaN  10  0.920407  0.239978       NaN       NaN
b     5.0   5.0   NaN  NaN  10  0.264029  0.675853       NaN       NaN
c     NaN   NaN   NaN  5.0   5       NaN       NaN       NaN  0.273653
d     NaN   NaN  10.0  NaN  10       NaN       NaN  0.507441       NaN
All  10.0  10.0  10.0  5.0  35  1.184437  0.915831  0.507441  0.273653


c2        All
c1
a    1.160386
b    0.939882
c    0.273653
d    0.507441
All  2.881362

In [131]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum,
               fill_value=0)

     c3                       c4
c2    A   B   C  D All         A         B         C         D       All
c1
a     5   5   0  0  10  0.920407  0.239978  0.000000  0.000000  1.160386
b     5   5   0  0  10  0.264029  0.675853  0.000000  0.000000  0.939882
c     0   0   0  5   5  0.000000  0.000000  0.000000  0.273653  0.273653
d     0   0  10  0  10  0.000000  0.000000  0.507441  0.000000  0.507441
All  10  10  10  5  35  1.184437  0.915831  0.507441  0.273653  2.881362

In [132]:
pd.crosstab(df.c1, df.c2)

c2  A  B  C  D
c1
a   1  1  0  0
b   1  1  0  0
c   0  0  0  1
d   0  0  2  0

In [133]:
pd.crosstab(df.c1, df.c2, values=df.c3, aggfunc=sum, margins=True)

c2      A     B     C    D  All
c1
a     5.0   5.0   NaN  NaN   10
b     5.0   5.0   NaN  NaN   10
c     NaN   NaN   NaN  5.0    5
d     NaN   NaN  10.0  NaN   10
All  10.0  10.0  10.0  5.0   35

In [134]:
s = pd.Series(['c1', 'c2', 'c1', 'c2', 'c1']*2)
s

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
dtype: object

In [135]:
pd.unique(s)

array(['c1', 'c2'], dtype=object)

In [136]:
pd.value_counts(s)

c1    6
c2    4
dtype: int64

In [137]:
code = pd.Series([0, 1, 0, 1, 0]*2)
code

0    0
1    1
2    0
3    1
4    0
5    0
6    1
7    0
8    1
9    0
dtype: int64

In [139]:
d = pd.Series(['c1', 'c2'])
d

0    c1
1    c2
dtype: object

In [140]:
d.take(code)

0    c1
1    c2
0    c1
1    c2
0    c1
0    c1
1    c2
0    c1
1    c2
0    c1
dtype: object

In [142]:
df = pd.DataFrame({'id':np.arange(len(s)),
                   'c':s,
                   'v':np.random.randint(1000, 5000, size=len(s))})
df

   id   c     v
0   0  c1  4043
1   1  c2  2609
2   2  c1  1657
3   3  c2  4936
4   4  c1  2895
5   5  c1  4271
6   6  c2  2894
7   7  c1  4586
8   8  c2  4730
9   9  c1  2047

In [143]:
c = df['c'].astype('category')
c

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [144]:
c.values

['c1', 'c2', 'c1', 'c2', 'c1', 'c1', 'c2', 'c1', 'c2', 'c1']
Categories (2, object): ['c1', 'c2']

In [145]:
c.values.categories

Index(['c1', 'c2'], dtype='object')

In [147]:
c.values.codes

array([0, 1, 0, 1, 0, 0, 1, 0, 1, 0], dtype=int8)

In [148]:
df['c'] = c
df.c

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [150]:
c = pd.Categorical(['c1', 'c2', 'c3', 'c1', 'c2'])
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [151]:
categories = ['c1', 'c2', 'c3']
codes = [0, 1, 2, 0, 1]
c = pd.Categorical.from_codes(codes, categories)
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [152]:
pd.Categorical.from_codes(codes, categories, ordered=True)

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [153]:
c.as_ordered()

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [154]:
c.codes

array([0, 1, 2, 0, 1], dtype=int8)

In [155]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

In [156]:
c = c.set_categories(['c1', 'c2', 'c3', 'c4', 'c5'])
c.categories

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [157]:
c.value_counts()

c1    2
c2    2
c3    1
c4    0
c5    0
dtype: int64

In [158]:
c[c.isin(['c1', 'c3'])]

['c1', 'c3', 'c1']
Categories (5, object): ['c1', 'c2', 'c3', 'c4', 'c5']

In [159]:
c = c.remove_unused_categories()

In [160]:
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [161]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

In [164]:
name_tuple = ['Suan Lee', 'Steven Jobs', 'Larry Page', 'Elon Musk', None, 'Bill Gates', 'Mark Zuckerberg', 'Jeff Bezos']
names = pd.Series(name_tuple)
names

0           Suan Lee
1        Steven Jobs
2         Larry Page
3          Elon Musk
4               None
5         Bill Gates
6    Mark Zuckerberg
7         Jeff Bezos
dtype: object

In [165]:
names.str.lower()

0           suan lee
1        steven jobs
2         larry page
3          elon musk
4               None
5         bill gates
6    mark zuckerberg
7         jeff bezos
dtype: object

In [166]:
names.str.len()

0     8.0
1    11.0
2    10.0
3     9.0
4     NaN
5    10.0
6    15.0
7    10.0
dtype: float64

In [167]:
names.str.split()

0           [Suan, Lee]
1        [Steven, Jobs]
2         [Larry, Page]
3          [Elon, Musk]
4                  None
5         [Bill, Gates]
6    [Mark, Zuckerberg]
7         [Jeff, Bezos]
dtype: object

In [168]:
names.str[0:4]

0    Suan
1    Stev
2    Larr
3    Elon
4    None
5    Bill
6    Mark
7    Jeff
dtype: object

In [169]:
names.str.split().str.get(-1)

0           Lee
1          Jobs
2          Page
3          Musk
4          None
5         Gates
6    Zuckerberg
7         Bezos
dtype: object

In [170]:
names.str.join('*')

0                  S*u*a*n* *L*e*e
1            S*t*e*v*e*n* *J*o*b*s
2              L*a*r*r*y* *P*a*g*e
3                E*l*o*n* *M*u*s*k
4                             None
5              B*i*l*l* *G*a*t*e*s
6    M*a*r*k* *Z*u*c*k*e*r*b*e*r*g
7              J*e*f*f* *B*e*z*o*s
dtype: object

In [172]:
names.str.match('([A-Za-z]+)')

0    True
1    True
2    True
3    True
4    None
5    True
6    True
7    True
dtype: object

In [173]:
names.str.findall('([A-Za-z]+)')

0           [Suan, Lee]
1        [Steven, Jobs]
2         [Larry, Page]
3          [Elon, Musk]
4                  None
5         [Bill, Gates]
6    [Mark, Zuckerberg]
7         [Jeff, Bezos]
dtype: object

In [175]:
idx = pd.DatetimeIndex(['2019-01-01', '2020-01-01', '2020-02-01', '2020-02-02', '2020-03-01'])
s = pd.Series([0, 1, 2, 3, 4], index=idx)
s

2019-01-01    0
2020-01-01    1
2020-02-01    2
2020-02-02    3
2020-03-01    4
dtype: int64